pengnianchun/Fangyan-dspic30f6012A-299/银隆客车-珠海公交/20180118-20T3/YinLong-PIC299-ZhuHaiGongJiao/src/SYSTEM.h
extern unsigned char Battery_Case_number;//电池箱号n
extern unsigned char Battery_Cell_number;//电池箱n内电池串数
extern unsigned char Battery_Cell_Temp_Number;//电池箱内电池温度探头个数

extern unsigned int  BMS_V;//电池总电压
extern unsigned int  BMS_A;//电池总电流
extern unsigned char BMS_SOC;//电池SOC
extern unsigned char BMS_Life;//BMS LIFE
extern unsigned char BMS_Status_Flag1;//电池状态1
extern unsigned char BMS_Status_Flag2;//电池状态2

extern unsigned int  Battery_Single_H; //电池单体高电压
extern unsigned int  Battery_Single_L; //电池单体低电压
extern unsigned char Battery_Temp_H; //电池单体最高温度
extern unsigned char Battery_Temp_L; //电池单体最低温度
extern unsigned char BMS_Status_Flag3;//电池状态3
extern unsigned char BMS_Status_Flag4;//继电器状态

extern unsigned char Battery_Single_H_Positon_Case; //电池单体高电压箱号
extern unsigned char Battery_Single_H_Positon_Cell; //电池单体高电压位置
extern unsigned char Battery_Single_L_Positon_Case; //电池单体低电压箱号
extern unsigned char Battery_Single_L_Positon_Cell; //电池单体低电压位置
extern unsigned char Battery_Temp_H_Positon_Case; //电池单体高温度箱号
extern unsigned char Battery_Temp_H_Positon_Cell; //电池单体高温度位置
extern unsigned char Battery_Temp_L_Positon_Case; //电池单体低温度箱号
extern unsigned char Battery_Temp_L_Positon_Cell; //电池单体低温度位置

extern DATA_BIT      BMU_Comm_Status[4];//1-8   BMU通讯状态
/*extern unsigned char BMU_Comm_Status2;//9-16  BMU通讯状态
extern unsigned char BMU_Comm_Status3;//17-24 BMU通讯状态
extern unsigned char BMU_Comm_Status4; //25-32 BMU通讯状态*/

extern DATA_BIT      BMU_Bala_Status[4]; //1-8   BMU均衡状态
/*extern unsigned char BMU_Bala_Status2; //9-16  BMU均衡状态
extern unsigned char BMU_Bala_Status3; //17-24 BMU均衡状态
extern unsigned char BMU_Bala_Status4; //25-32 BMU均衡状态*/

extern unsigned char DC1positive_Temp;//充电插头DC1+温度
extern unsigned char DC1negative_Temp;//充电插头DC1-温度
extern unsigned char DC2positive_Temp;//充电插头DC2+温度
extern unsigned char DC2negative_Temp;//充电插头DC2-温度
extern unsigned int  Ohm_Positive;//总正绝缘阻值 
extern unsigned int  Ohm_Negative;//总负绝缘阻值 

extern unsigned int  Energe_Rest;//剩余能量
extern unsigned char BMS_Status_Flag5;
extern unsigned char BMS_Status_Flag6;

extern unsigned char Battery_Single_H_Positon_Total;//最高单体电压位置（总数）
extern unsigned char Battery_Single_L_Positon_Total;//最低单体电压位置（总数）
extern unsigned char Battery_Temp_H_Positon_Total;//最高单体温度位置（总数）
extern unsigned char Battery_Temp_L_Positon_Total;//最低单体温度位置（总数）
extern unsigned char Battery_Single_H_Pack;//最高单体电压包号
extern unsigned char Battery_Single_L_Pack;//最低单体电压包号
extern unsigned char Battery_Temp_H_Pack;//最高单体温度包号
extern unsigned char Battery_Temp_L_Pack;//最低单体温度包号

extern unsigned char DC3positive_Temp; //充电插头DC3+温度
extern unsigned char DC3negative_Temp; //充电插头DC3-温度
extern unsigned char DC4positive_Temp; //充电插头DC4+温度
extern unsigned char DC4negative_Temp; //充电插头DC4-温度
extern unsigned char BMS_KtStatus_Flag5;//继电器状态5

extern unsigned char BMU_Number;//BMU号

extern unsigned char Battery_Pack; //电池报文包数
extern unsigned int  Battery_Voltage[12]; //电池单体电压
extern unsigned int  Battery_Temp[12]; //电池单体温度

//电池管理系统反馈充电插座插拔次数等信息 BMS -LCD03
extern unsigned int ChargeSet_Times1;
extern unsigned int ChargeSet_Times2;
extern unsigned int ChargeSet_Times3;
extern unsigned int ChargeSet_Times4;

//ECAS空气悬挂协议 0x0CFE5A2F
typedef union {

    struct {
        unsigned four1_1 : 4;
        unsigned four1_2 : 4;

        unsigned double2_1 : 2;
        unsigned double2_2 : 2;
        unsigned double2_3 : 2;
        unsigned double2_4 : 2;

        unsigned double3_1 : 2;
        unsigned double3_2 : 2;
        unsigned double3_3 : 2;
        unsigned double3_4 : 2;

        unsigned four4_1 : 4;
        unsigned four4_2 : 4;

        unsigned double5_1 : 2;
        unsigned double5_2 : 2;
        unsigned double5_3 : 2;
        unsigned double5_4 : 2;

        unsigned four6_1 : 4;
        unsigned four6_2 : 4;

        unsigned four7_1 : 4;
        unsigned four7_2 : 4;

        unsigned four8_1 : 4;
        unsigned four8_2 : 4;
    };
    unsigned char BYTE[8];
}_CAN_0x0CFE5A2F;
extern _CAN_0x0CFE5A2F CAN_0xCFE5A2F;

/**********随州协议变量************/
/*extern unsigned int moto_voltage; //电机电压
extern unsigned int moto_current; //电机电流
extern unsigned int moto_speed; //电动转速
extern unsigned char Motor_Temperature; //电机温度
extern unsigned char Inverter_t; //逆变器温度

extern unsigned char Accelerator; //油门开度
extern unsigned int Engine_Speed;//发动机转速

extern unsigned int Fule_rate;//油耗
extern unsigned char water_temp;//水温
extern unsigned char Engine_Fuhe;//发动机负荷
extern unsigned char Niaosu;//尿素;
extern unsigned char Accelerator_Shiji; //油门踏板实际
extern unsigned char Engine_oil_press; //机油压力
extern unsigned char ambient_air_temperature; //周围空气温度

extern unsigned char Current_Gear; //档位
extern unsigned char TCU_Position;//离合位置
extern unsigned char TCU_warn;//变速箱故障
extern unsigned char STOP;//停车故障
extern unsigned int Speed_rmp; //输出轴转速
extern unsigned char Car_mode;//整车模式
extern unsigned char TCU_code;//变速箱故障代码
extern unsigned char TCU_level;//变速箱故障等级

extern DATA_BIT CAN_KEY[4];
#define  CAN_ON           CAN_KEY[0].bit1
#define  CAN_ACC          CAN_KEY[0].bit2  
#define  Diagnosis        CAN_KEY[0].bit3  
#define  Mode_S           CAN_KEY[0].bit4  
#define  AC               CAN_KEY[0].bit5  
#define  Hybrid           CAN_KEY[0].bit6  
#define  Electric         CAN_KEY[0].bit7  
#define  Tradition        CAN_KEY[0].bit8  

#define  High_Voltage     CAN_KEY[1].bit5
#define  Charge_Check     CAN_KEY[1].bit6  

#define  Kt               CAN_KEY[2].bit2  

#define  Brake_Pedal      CAN_KEY[3].bit1 
extern unsigned char Brake_percent; //制动踏板开度
extern unsigned char Speed_percent; //加速踏板开度
extern unsigned char Digit_input3;//数字量输入3

extern unsigned long Program;//程序版本
extern unsigned long tcu_spn; //TCU故障码
extern unsigned char tcu_fmi;
extern unsigned long tcu_cm; 
extern unsigned char tcu_oc;
extern unsigned char Car_LIFE;//整车控制器

extern unsigned int BMS_V; //电池电压
extern unsigned char BMS_SOC; //电池SOC
extern unsigned int BMS_A; //电池电流
extern unsigned char Status_Flag1;
extern unsigned char Status_Flag2;
extern unsigned char Status_Flag3;

extern unsigned int BMS_A_charge; //最大充电电流
extern unsigned int BMS_A_discharge; //最大电流
extern unsigned char Warn_level;//故障等级
extern unsigned int BMS_V_average; //电池平均电压
extern unsigned char BMS_T_H;//电池最高温度

extern unsigned int Oum_zheng; //绝缘正阻值
extern unsigned int Oum_fu; //绝缘负阻值
extern unsigned int Battery_single_H; //电池单体高电压
extern unsigned int Battery_single_L; //电池单体低电压

extern unsigned char Battery_number[10];//电池编号
extern unsigned int Battery_voltage[10];//电池单体电压

